app/views/tasks/create.js.erb

alert("le fichier JS est exécuté!");
document.getElementById("<%= @category.title %>").insertAdjacentHTML("beforeend", "<%= j render 'task', task: @task%>")
---
INSERT INTO "tasks" ("created_at", "updated_at", "title", "deadline", "category_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", "2019-08-29 08:27:05.311190"], ["updated_at", "2019-08-29 08:27:05.311190"], ["title", "nambi"], ["deadline", "2019-08-31 00:00:00"], ["category_id", 2]]