app/controllers/emails_controller.rb

SELECT "emails".* FROM "emails"
SELECT "emails".* FROM "emails" WHERE "emails"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
---
	def show
		@emails = Email.all
		@email = Email.find(params[:id])

INSERT INTO "emails" ("object", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["object", "pearle@kirlinstracke.co"], ["body", "Feel the force!"], ["created_at", "2019-08-30 02:21:56.912099"], ["updated_at", "2019-08-30 02:21:56.912099"]]
---
	def create
     @email = Email.create(object:Faker::Internet.email,
		                   body:Faker::Quote.yoda)

SELECT "emails".* FROM "emails" WHERE "emails"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "emails" SET "read" = $1, "updated_at" = $2 WHERE "emails"."id" = $3  [["read", false], ["updated_at", "2019-08-30 02:29:01.783476"], ["id", 28]]
UPDATE "emails" SET "read" = $1, "updated_at" = $2 WHERE "emails"."id" = $3  [["read", true], ["updated_at", "2019-08-30 02:29:06.777093"], ["id", 28]]
---
 def update
   @email = Email.find(params[:id])
    if (@email.read == true || @email.read == nil)
      @email.read = false
      @email.save
    else
      @email.read = true
      @email.save

SELECT "emails".* FROM "emails" WHERE "emails"."id" = $1 LIMIT $2  [["id", 43], ["LIMIT", 1]]
DELETE FROM "emails" WHERE "emails"."id" = $1  [["id", 43]]
---
      def destroy
      @email = Email.find(params[:id])
      @email.destroy