app/controllers/tasks_controller.rb

SELECT "categories".* FROM "categories"
---
  def new
    @categories = Category.all

SELECT "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "tasks" ("created_at", "updated_at", "title", "deadline", "category_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", "2019-08-29 07:29:59.542850"], ["updated_at", "2019-08-29 07:29:59.542850"], ["title", "GLOPOPOPY kin"], ["deadline", "2019-09-01 00:00:00"], ["category_id", 1]]
INSERT INTO "tasks" ("created_at", "updated_at", "title", "deadline", "category_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", "2019-08-29 12:57:57.364085"], ["updated_at", "2019-08-29 12:57:57.364085"], ["title", "GLOPOPOPY"], ["deadline", "2019-08-16 00:00:00"], ["category_id", 1]]
---
  def create
    @task = Task.new(task_params) # ok


    @category = Category.find(category_params)

    @task.category = @category



    respond_to do |format|

        format.html {

          if @task.save
            redirect_to root_path
            flash[:notice] = "Task created"

          else
            redirect_to root_path
            flash[:notice] = "Please try again"

          end
        }

      format.js {@task.save}

SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 54], ["LIMIT", 1]]
UPDATE "tasks" SET "status" = $1, "updated_at" = $2 WHERE "tasks"."id" = $3  [["status", true], ["updated_at", "2019-08-29 16:14:37.643378"], ["id", 54]]
---
  def update
    @task = Task.find(params[:id])
    @task.update(status: params[:change])  # maka lay noma ary am check_box