app/controllers/tasks_controller.rb

DELETE FROM "tasks" WHERE "tasks"."id" = $1  [["id", 63]]
---
  def destroy
   @task = Task.find(params[:id])
    @task.destroy